narfu-serialize/src/DataProcessors/ЗагрузкаXML/ЗагрузкаXML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаXML</name>
  <tabularSections>
    <name>ДанныеФайла</name>
    <attributes>
      <name>Ссылка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭлектроннойПочты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеФайлаНомера</name>
  </tabularSections>
  <tabularSections>
    <name>ДанныеФайлаБронь</name>
  </tabularSections>
</mdclass:DataProcessor>

narfu-serialize/src/Documents/Бронирование/Бронирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирование</name>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНомера</name>
    <type>
      <types>CatalogRef.ТипыНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавтракВключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Постояльцы</name>
    <attributes>
      <name>Постоялец</name>
      <type>
        <types>CatalogRef.Постояльцы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

narfu-serialize/src/Catalogs/Постояльцы/Постояльцы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Постояльцы</name>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

narfu-serialize/src/Catalogs/ТипыНомеров/ТипыНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыНомеров</name>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

narfu-serialize/src/DataProcessors/ЗагрузкаXML/Forms/Форма/Module.bsl
#Область ЗагрузкаДанных
&НаСервере
Процедура ЗагрузкаНаСервере(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();  
	
	СпособЧтения = "XDTO";
	
	Если СпособЧтения  = "XDTO" Тогда
		
		ЧтениеXML = Новый ЧтениеXML;   
		ЧтениеXML.ОткрытьПоток(Поток);
		ДанныеXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML); 
				
		//постояльцы
		Для Каждого ДанныеПостояльцы из ДанныеXDTO.Постояльцы.Постоялец Цикл
			Постояльцы  = Справочники.Постояльцы.СоздатьЭлемент();
			Постояльцы.Наименование = ДанныеПостояльцы.ФИО; 
			Постояльцы.Телефон = ДанныеПостояльцы.Телефон; 
			Постояльцы.АдресЭлектроннойПочты = ДанныеПостояльцы.Почта;  
			Постояльцы.Пол = ДанныеПостояльцы.Пол;
			Постояльцы.ДатаРождения = ДанныеПостояльцы.ДатаРождения;
			Постояльцы.Записать();   
		КонецЦикла; 
		//типыномеров
		Для Каждого ДанныеНомера из ДанныеXDTO.ТипыНомеров.ТипНомера Цикл      
			
			ТипыНомеров  = Справочники.ТипыНомеров.СоздатьЭлемент();
			ТипыНомеров.Наименование = ДанныеНомера.Наименование;
			ТипыНомеров.Количество = ДанныеНомера.Количество;
			ТипыНомеров.Цена = ДанныеНомера.Цена;
			ТипыНомеров.Описание = ДанныеНомера.Описание;
			ТипыНомеров.Записать(); 
			
		КонецЦикла;
		
		Для Каждого ДанныеБронь из ДанныеXDTO.Бронирования.Бронирование Цикл         
			//бронирование
			Бронирования = Документы.Бронирование.СоздатьДокумент();
			Бронирования.Дата = ДанныеБронь.Дата;
			Бронирования.Номер = ДанныеБронь.Номер;
			Бронирования.ДатаЗаезда = ДанныеБронь.ДатаЗаезда;
			Бронирования.ДатаВыезда = ДанныеБронь.ДатаВыезда; 
						
			Бронирования.ТипНомера = Справочники.ТипыНомеров.НайтиПоКоду(ДанныеБронь.ТипНомера);
							
			ПостоялецБрони = Бронирования.Постояльцы.Добавить(); 
			ПостоялецБрони.Постоялец =  Справочники.Постояльцы.НайтиПоКоду(ДанныеБронь.Постоялец);
				
			Бронирования.Записать(РежимЗаписиДокумента.Проведение); 
			
		КонецЦикла; 

		Сообщить("Данные загружены!");
	КонецЕсли; 
					
КонецПроцедуры     

&НаКлиенте
Асинх Процедура Загрузка(Команда) 
	
	ПараметрыДиалога =  Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = "Текстовый документ|*.xml;";
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыДиалога);
	
	ЗагрузкаНаСервере(Результат.Адрес);

	
КонецПроцедуры
#КонецОбласти
